org/cv/cv.org
#+AUTHOR:    Mahan Fathi
#+EMAIL:     mahan0fathi@gmail.com


* Education
*** Mila: Montreal Institute for Learning Algorithms (M.Sc.) [2020-22]
#+begin_verse
University of Montreal, School of Computer Science. Advised by Prof. [[http://pierrelucbacon.com/][Pierre-Luc Bacon]].
#+end_verse
*** Sharif University of Technology (B.Sc.) [2013-17. GPA: 3.88/4.0]
#+begin_verse
School of Mechanical Engineering, Dynamics and Control.
[[http://www.openthesis.org/document/view/603263_0.pdf][Bachelor Thesis]]: Nonlinear Control of a Ballbot, with Focus on Sample-Based Motion Planning Algorithms.
#+end_verse
*** NODET: High School [2009-13. GPA: 19.3/20.0]
#+begin_verse
National Organization for Development of Exceptional Talents, Mathematics and Physics.
#+end_verse

-----

* Awards and Fellowships
*** Research Assistantship at Aalto University [Jun. to Sep. 2019]
#+begin_verse
AI, ML, and Game Development. Prof. [[http://perttu.info/][Perttu Hämäläinen]].
#+end_verse
*** Awarded Membership to National Elite Foundation [Aug. 2013]
*** Silver Medalist at 25th National Physics Olympiad [Sep. 2012]

-----

* Publications
*** Control of a Ballbot Using Sampling-Based Methods (1st Author)
#+begin_verse
Submitted to Scientia Iranica, published by Sharif University of Technology.
#+end_verse
*** [[https://www.civilica.com/Paper-ISME24-ISME24_657.html][Geometry Optimization of a Single-Blade Windshield Wiper]] (1st Author)
#+begin_verse
ISME2016: 24th Annual International Conference on Mechanical Engineering.
#+end_verse

-----

* Research
*** [[github:MahanFathi/Model-Based-RL][Model-Based Policy Gradients]] [Jul. to Sep. 2019]
#+begin_verse
 Motions emerge from directly back-proping into policy networks using reparam trick and physics gradients calculated in MuJoCo.
 To backprop into stochastic policies, given an unknown model, one has to use the REINFORCE theory, to be able to calculate the gradients by sampling the environment. These methods usually have high variance, so baselines and value/advantage functions were introduced. Another way to backpropagate into your policy network is to use the “reparameterization trick” as in VAEs, but they entail knowledge of upstream gradients, and hence a known model. The policy gradients calculated w/ the reparam trick are often much lower in variance, so one can go wo/ baselines and value networks. This project puts it all together: computation graph of policy and dynamics, upstream gradients from MuJoCo dynamics and rewards, reparam trick, and optimization.
#+end_verse
*** [[github:MahanFathi/Unity2OpenSim][Unity2OpenSim]] [Jun. to Jul. 2019]
#+begin_verse
A corss-platform painless pipeline to perform Inverse Kinematics/Dynamics of OpenSim on Unity models and motions.
#+end_verse
*** [[https://github.com/MahanFathi/iLQG-MuJoCo][MPC of MuJoCo Agents Using iLQG]] [Dec. 2017 to Jan. 2018]
#+begin_verse
Inspired by the work of Todorov et al., implemented a fast Iterative LQG solver that reliably commands agents, such as the Hopper, in MPC mode, in presence of external forces.
#+end_verse
*** Motion Mimic [Nov. 2017 to Jan. 2018]
#+begin_verse
Thanks to the readily available CMU MoCap, a bottom-half MuJoCo model of a bipedal is able to stably and naturally walk via *Generative Adversarial Imitation Learning(TRPO)* and stading punching motions are succesfuly mimiced for a humanoid using *DeepMimic(PPO)* in *Unity3D(ML-Agents)*.
#+end_verse
*** Non-Holonomic Kinodynamic Motion Planning [May. 2017]
#+begin_verse
Using optimal control as a fast inverse dynamic model, a general sample-based motion planning algorithm was proposed for complex non-holonomic agents in kinodynamic spaces.
#+end_verse
