cv/cv.html
<?xml version="1.0" encoding="utf-8"?>
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-07-03 Fri 13:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mahan Fathi" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org09c2d6f">1. Education</a>
<ul>
<li>
<ul>
<li><a href="#org1018f08">1.0.1. Mila: Montreal Institute for Learning Algorithms (M.Sc.) [2020-22]</a></li>
<li><a href="#org0fc281c">1.0.2. Sharif University of Technology (B.Sc.) [2013-17. GPA: 3.88/4.0]</a></li>
<li><a href="#org8add78d">1.0.3. NODET: High School [2009-13. GPA: 19.3/20.0]</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb0c485f">2. Awards and Fellowships</a>
<ul>
<li>
<ul>
<li><a href="#org8a9e59a">2.0.1. Research Assistantship at Aalto University [Jun. to Sep. 2019]</a></li>
<li><a href="#org2d5fe4c">2.0.2. Awarded Membership to National Elite Foundation [Aug. 2013]</a></li>
<li><a href="#org9098a50">2.0.3. Silver Medalist at 25th National Physics Olympiad [Sep. 2012]</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org3e756e6">3. Publications</a>
<ul>
<li>
<ul>
<li><a href="#org71f07ac">3.0.1. Control of a Ballbot Using Sampling-Based Methods (1st Author)</a></li>
<li><a href="#org58b7640">3.0.2. Geometry Optimization of a Single-Blade Windshield Wiper (1st Author)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge4c9299">4. Research</a>
<ul>
<li>
<ul>
<li><a href="#orgf2681ac">4.0.1. Model-Based Policy Gradients [Jul. to Sep. 2019]</a></li>
<li><a href="#org7ae5eca">4.0.2. Unity2OpenSim [Jun. to Jul. 2019]</a></li>
<li><a href="#org5b176fc">4.0.3. MPC of MuJoCo Agents Using iLQG [Dec. 2017 to Jan. 2018]</a></li>
<li><a href="#org63435f8">4.0.4. Motion Mimic [Nov. 2017 to Jan. 2018]</a></li>
<li><a href="#orga761bde">4.0.5. Non-Holonomic Kinodynamic Motion Planning [May. 2017]</a></li>
<li><a href="#org8b92fef">4.0.6. Nonlinear Control of a Ballbot</a></li>
<li><a href="#org5ec3d72">4.0.7. Unsupervised Object Localization [Sep. 2018]</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf749cf0">5. Experince</a>
<ul>
<li>
<ul>
<li><a href="#org6ca06d9">5.0.1. Team Leader at CafeBazaar [Sep. 2019 _Ongoing_]</a></li>
<li><a href="#org7c73c57">5.0.2. Senior Data Scientist at CafeBazaar [Oct. 2018 to Sep. 2019]</a></li>
<li><a href="#org4484fe3">5.0.3. Senior Backend Developer at TAPSI [May. to Oct. 2018]</a></li>
<li><a href="#orga778d10">5.0.4. Data Scientist at TAPSI [Feb. to May. 2018]</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org6485b67">6. Projects</a>
<ul>
<li>
<ul>
<li><a href="#org32ad767">6.0.1. AR Navigation [Jul. 2019 _Ongoing_]</a></li>
<li><a href="#orgcabbe77">6.0.2. OBJET: A Computer Vision Graphical Sandbox [Feb. to Mar. 2020]</a></li>
<li><a href="#orged8ebdf">6.0.3. Road Extraction from Satellite Imagery [Jan. to Mar. 2020]</a></li>
<li><a href="#orgd45653f">6.0.4. Automated Face, Plate Number, Etc. Censorship of Balad’s Street Imagery via YOLOv3 [Nov. 2019 to Jan. 2020]</a></li>
<li><a href="#org37b2b17">6.0.5. Object Extraction from Satellite Imagery [Dec. 2019 to Jan. 2020]</a></li>
<li><a href="#org79635e5">6.0.6. Automated Tagging of Crowd-sourced Images [Nov. to Dec. 2019]</a></li>
<li><a href="#org3321804">6.0.7. Extraction of Speed Bumps and Traffic Lights from GPS Logs [Dec. 2019]</a></li>
<li><a href="#orge1e0765">6.0.8. Live Traffic [Mar. 2019]</a></li>
<li><a href="#org7e60f13">6.0.9. Street Imagery Sensitive Content Censorship [Feb. 2019]</a></li>
<li><a href="#org98a80ed">6.0.10. RNN ETA [Feb. to Mar. 2019]</a></li>
<li><a href="#orgc06bffd">6.0.11. Detection and Tracking of Points of Interest [Nov. 2018 Jan. 2019]</a></li>
<li><a href="#orgffc83ec">6.0.12. Learning to Drive in 2 Days [Mar. 2019]</a></li>
<li><a href="#orgec8b9ad">6.0.13. Location Service Rewrite [Oct. 2018]</a></li>
<li><a href="#org88bc4ff">6.0.14. Semi-concurrent Dispatch Algorithm [May. 2018 Aug. 2018]</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org3388b64">7. Skills</a>
<ul>
<li>
<ul>
<li><a href="#orge844c22">7.0.1. Computer Science</a></li>
<li><a href="#org3e8e11b">7.0.2. Programming</a></li>
<li><a href="#orga29f31d">7.0.3. Other</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org6506202">8. Coursework</a>
<ul>
<li>
<ul>
<li><a href="#org9fabe0f">8.0.1. Machine Learning</a></li>
<li><a href="#org9e53d21">8.0.2. Control Theory and Robotics</a></li>
<li><a href="#org3167da2">8.0.3. Robotics Related Courses from Bachelor</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org7f8be77">9. Teaching</a>
<ul>
<li>
<ul>
<li><a href="#org43a075b">9.0.1. Mathematica Instructor [Dec. 2016]</a></li>
<li><a href="#org2a6002c">9.0.2. Physics Olympiad Instructor [Jun. to Nov. 2014]</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org82c6b84">10. Language</a>
<ul>
<li>
<ul>
<li><a href="#org44f0924">10.0.1. Persian(native), English(TOEFL iBT: 110 ), and German(basic)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org1387599">11. Interests</a></li>
</ul>
</div>
</div>


<div id="outline-container-org09c2d6f" class="outline-2">
<h2 id="org09c2d6f"><span class="section-number-2">1</span> Education</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org1018f08" class="outline-4">
<h4 id="org1018f08"><span class="section-number-4">1.0.1</span> Mila: Montreal Institute for Learning Algorithms (M.Sc.) [2020-22]</h4>
<div class="outline-text-4" id="text-1-0-1">
<p class="verse">
University of Montreal, School of Computer Science. Advised by Prof. <a href="http://pierrelucbacon.com/">Pierre-Luc Bacon</a>.<br />
</p>
</div>
</div>
<div id="outline-container-org0fc281c" class="outline-4">
<h4 id="org0fc281c"><span class="section-number-4">1.0.2</span> Sharif University of Technology (B.Sc.) [2013-17. GPA: 3.88/4.0]</h4>
<div class="outline-text-4" id="text-1-0-2">
<p class="verse">
School of Mechanical Engineering, Dynamics and Control.<br />
<a href="http://www.openthesis.org/document/view/603263_0.pdf">Bachelor Thesis</a>: Nonlinear Control of a Ballbot, with Focus on Sample-Based Motion Planning Algorithms.<br />
</p>
</div>
</div>
<div id="outline-container-org8add78d" class="outline-4">
<h4 id="org8add78d"><span class="section-number-4">1.0.3</span> NODET: High School [2009-13. GPA: 19.3/20.0]</h4>
<div class="outline-text-4" id="text-1-0-3">
<p class="verse">
National Organization for Development of Exceptional Talents, Mathematics and Physics.<br />
</p>

<hr />
</div>
</div>
</div>

<div id="outline-container-orgb0c485f" class="outline-2">
<h2 id="orgb0c485f"><span class="section-number-2">2</span> Awards and Fellowships</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org8a9e59a" class="outline-4">
<h4 id="org8a9e59a"><span class="section-number-4">2.0.1</span> Research Assistantship at Aalto University [Jun. to Sep. 2019]</h4>
<div class="outline-text-4" id="text-2-0-1">
<p class="verse">
AI, ML, and Game Development. Prof. <a href="http://perttu.info/">Perttu Hämäläinen</a>.<br />
</p>
</div>
</div>
<div id="outline-container-org2d5fe4c" class="outline-4">
<h4 id="org2d5fe4c"><span class="section-number-4">2.0.2</span> Awarded Membership to National Elite Foundation [Aug. 2013]</h4>
</div>
<div id="outline-container-org9098a50" class="outline-4">
<h4 id="org9098a50"><span class="section-number-4">2.0.3</span> Silver Medalist at 25th National Physics Olympiad [Sep. 2012]</h4>
<div class="outline-text-4" id="text-2-0-3">
<hr />
</div>
</div>
</div>

<div id="outline-container-org3e756e6" class="outline-2">
<h2 id="org3e756e6"><span class="section-number-2">3</span> Publications</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org71f07ac" class="outline-4">
<h4 id="org71f07ac"><span class="section-number-4">3.0.1</span> Control of a Ballbot Using Sampling-Based Methods (1st Author)</h4>
<div class="outline-text-4" id="text-3-0-1">
<p class="verse">
Submitted to Scientia Iranica, published by Sharif University of Technology.<br />
</p>
</div>
</div>
<div id="outline-container-org58b7640" class="outline-4">
<h4 id="org58b7640"><span class="section-number-4">3.0.2</span> <a href="https://www.civilica.com/Paper-ISME24-ISME24_657.html">Geometry Optimization of a Single-Blade Windshield Wiper</a> (1st Author)</h4>
<div class="outline-text-4" id="text-3-0-2">
<p class="verse">
ISME2016: 24th Annual International Conference on Mechanical Engineering.<br />
</p>

<hr />
</div>
</div>
</div>

<div id="outline-container-orge4c9299" class="outline-2">
<h2 id="orge4c9299"><span class="section-number-2">4</span> Research</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgf2681ac" class="outline-4">
<h4 id="orgf2681ac"><span class="section-number-4">4.0.1</span> <a href="https://github.com/MahanFathi/Model-Based-RL">Model-Based Policy Gradients</a> [Jul. to Sep. 2019]</h4>
<div class="outline-text-4" id="text-4-0-1">
<p class="verse">
Motions emerge from directly back-proping into policy networks using reparam trick and physics gradients calculated in MuJoCo.<br />
To backprop into stochastic policies, given an unknown model, one has to use the REINFORCE theory, to be able to calculate the gradients by sampling the environment. These methods usually have high variance, so baselines and value/advantage functions were introduced. Another way to backpropagate into your policy network is to use the “reparameterization trick” as in VAEs, but they entail knowledge of upstream gradients, and hence a known model. The policy gradients calculated w/ the reparam trick are often much lower in variance, so one can go wo/ baselines and value networks. This project puts it all together: computation graph of policy and dynamics, upstream gradients from MuJoCo dynamics and rewards, reparam trick, and optimization.<br />
</p>
</div>
</div>
<div id="outline-container-org7ae5eca" class="outline-4">
<h4 id="org7ae5eca"><span class="section-number-4">4.0.2</span> <a href="https://github.com/MahanFathi/Unity2OpenSim">Unity2OpenSim</a> [Jun. to Jul. 2019]</h4>
<div class="outline-text-4" id="text-4-0-2">
<p class="verse">
A corss-platform painless pipeline to perform Inverse Kinematics/Dynamics of OpenSim on Unity models and motions.<br />
</p>
</div>
</div>
<div id="outline-container-org5b176fc" class="outline-4">
<h4 id="org5b176fc"><span class="section-number-4">4.0.3</span> <a href="https://github.com/MahanFathi/iLQG-MuJoCo">MPC of MuJoCo Agents Using iLQG</a> [Dec. 2017 to Jan. 2018]</h4>
<div class="outline-text-4" id="text-4-0-3">
<p class="verse">
Inspired by the work of Todorov et al., implemented a fast Iterative LQG solver that reliably commands agents, such as the Hopper, in MPC mode, in presence of external forces.<br />
</p>
</div>
</div>
<div id="outline-container-org63435f8" class="outline-4">
<h4 id="org63435f8"><span class="section-number-4">4.0.4</span> Motion Mimic [Nov. 2017 to Jan. 2018]</h4>
<div class="outline-text-4" id="text-4-0-4">
<p class="verse">
Thanks to the readily available CMU MoCap, a bottom-half MuJoCo model of a bipedal is able to stably and naturally walk via <b>Generative Adversarial Imitation Learning(TRPO)</b> and stading punching motions are succesfuly mimiced for a humanoid using <b>DeepMimic(PPO)</b> in <b>Unity3D(ML-Agents)</b>.<br />
</p>
</div>
</div>
<div id="outline-container-orga761bde" class="outline-4">
<h4 id="orga761bde"><span class="section-number-4">4.0.5</span> Non-Holonomic Kinodynamic Motion Planning [May. 2017]</h4>
<div class="outline-text-4" id="text-4-0-5">
<p class="verse">
Using optimal control as a fast inverse dynamic model, a general sample-based motion planning algorithm was proposed for complex non-holonomic agents in kinodynamic spaces.<br />
</p>
</div>
</div>
