org/cv/cv.org
*** [[http://www.openthesis.org/document/view/603263_0.pdf][Nonlinear Control of a Ballbot]]
#+begin_verse
Online motion and path planning of the highly nonlinear Rezero, using RRT and optimal control.
#+end_verse
*** [[https://www.slideshare.net/slideshow/embed_code/key/wyRKZKDDHxy1AF][Unsupervised Object Localization]] [Sep. 2018]
#+begin_verse
Extracting the deep-seated spatial information of classification networks by Guided Back-propagating most affecting neurons to the image, enables us to spot image parts corresponding to the object.
#+end_verse

-----

* Experince
*** Team Leader at [[https://cafebazaar.ir/?l=en][CafeBazaar]] [Sep. 2019 _Ongoing_]
#+begin_verse
I am currently at [[https://balad.ir/about][Balad]] , the biggest domestic map and navigation application of Iran, a product of the Iranian tech giant, CafeBazaar.

- Technical Leadership and Product Management of Data Infrastructure, a team of 7, responsible for attending to the data science needs of the map tribe (Sep. 2019 - Apr. 2020).

- Team Leader of Augmented Reality team (Sep. 2019 - Ongoing).

- Team Leader of ETA&Traffic, a team of Software Engineers and Data Scientists, concerned with ETA and Traffic (-__-) (Apr. 2020 - Ongoing).

#+end_verse
*** Senior Data Scientist at CafeBazaar [Oct. 2018 to Sep. 2019]
#+begin_verse
I worked at Navigation team at Balad on route planning, traffic prediction, and ETA using data-driven methods. Moreover, as a computer vision scientist I was concerned with information extraction from street and aerial imagery.
#+end_verse
*** Senior Backend Developer at [[https://tapsi.ir/][TAPSI]] [May. to Oct. 2018]
#+begin_verse
I was a member of the Dispatch/Pricing team at TAPSI, which is somehow the heart of any ride-hailing platform. Whenever a ride request is submitted, we are the invisible hands behind, connecting riders and drivers.
#+end_verse
*** Data Scientist at TAPSI [Feb. to May. 2018]
#+begin_verse
Among the biggest Iranian tech companies, TAPSI is a ride-hailing platform with millions of monthly active users.
#+end_verse

-----

* Projects
*** AR Navigation [Jul. 2019 _Ongoing_]
#+begin_verse
Providing users with an Augmented Reality driven experience for navigation.
The team tackled the problem of finding the near-optimal vanishing point for a sequence of input images and depiction of graphical instructions accordingly, from OpenGL scratch. For now, the system is embedded in Balad running on Android phones.
#+end_verse
*** [[https://github.com/MahanFathi/OBJET][OBJET: A Computer Vision Graphical Sandbox]] [Feb. to Mar. 2020]
#+begin_verse
OBJET, is a graphical environment, developed in C++/OpenGL and accessible in Python via SWIG, to cater to the data needs of one willing to conduct research on computer vision in such domains. Load your own objects in a room, take a snapshot of the viewport, from the viewpoint of the customizable camera, and load it to python. This gives you the ability to create data on-the-fly, in your python data loader.
#+end_verse
*** Road Extraction from Satellite Imagery [Jan. to Mar. 2020]
#+begin_verse
Extraction of the graph of roads from aerial images, via image segmentation and a shitload of post-processing.
#+end_verse
*** Automated Face, Plate Number, Etc. Censorship of Balad’s Street Imagery via YOLOv3 [Nov. 2019 to Jan. 2020]
#+begin_verse
Significantly enhanced the former RCNN driven approach in terms of performance.
#+end_verse
*** Object Extraction from Satellite Imagery [Dec. 2019 to Jan. 2020]
Extraction of building boundaries, parks, bridges, crosswalks, parking lots, etc. from satellite imagery.
*** Automated Tagging of Crowd-sourced Images [Nov. to Dec. 2019]
#+begin_verse
A service responsible for automated tagging of crowd-sourced images with labels such as #indoor/outdoor, #menu, #food, #persons_posing, etc.
#+end_verse
*** Extraction of Speed Bumps and Traffic Lights from GPS Logs [Dec. 2019]
*** Live Traffic [Mar. 2019]
#+begin_verse
Design, implementation, optimization, deployment, maintenance, and storage of real-time user GPS data, single-handedly. The service assigns a traffic metric to map road segments, which are then used by Navigation and ETA services.
#+end_verse
*** Street Imagery Sensitive Content Censorship [Feb. 2019]
#+begin_verse
YOLOv3 is the core of this fast censor network, responsible for blurring of faces and licence plates in street images.
#+end_verse
*** RNN ETA [Feb. to Mar. 2019]
#+begin_verse
Reducing Balad's ETA MSE by a factor of 2, using a segment-based LSTM, trained on GPS logs.
#+end_verse
*** [[https://blog.usejournal.com/collecting-a-nations-points-of-interest-computer-vision-to-the-rescue-41026053bdf6][Detection and Tracking of Points of Interest]] [Nov. 2018 Jan. 2019]
#+begin_verse
Trained and deployed a Mask-RCNN model for detection of the store signs. Also came up with a novel tracking algorithm to bundle up repeating billboards in subsequent images. Read about it at [[https://blog.usejournal.com/collecting-a-nations-points-of-interest-computer-vision-to-the-rescue-41026053bdf6][my personal blog]] and [[http://vrgl.ir/jBg3J][CafeBazaar tech blog]].
#+end_verse
*** [[github:MahanFathi/end2end-self-driving-car][Learning to Drive in 2 Days]] [Mar. 2019]
#+begin_verse
Inspired by the work of NVIDIA on DAVE-2, in a team of 6, at the 7th Hackathon of CafeBazaar, we collected just enough data, to train an end-to-end deep conv-net to infer steering angle for each captured image. We then came by a pipeline to connect the center camera to this module at the test time. We were able to achieve the MVP of staying in lanes and avoiding doubled-parked cars. [[https://vimeo.com/371631581][Here is a video]]!
#+end_verse
*** Location Service Rewrite [Oct. 2018]
#+begin_verse
Reducing the response time of TAPSI’s main bottleneck by a crazy factor. We made heavy use of Lua and Redis.
#+end_verse
