cv/cv.html
<div id="outline-container-org8b92fef" class="outline-4">
<h4 id="org8b92fef"><span class="section-number-4">4.0.6</span> <a href="http://www.openthesis.org/document/view/603263_0.pdf">Nonlinear Control of a Ballbot</a></h4>
<div class="outline-text-4" id="text-4-0-6">
<p class="verse">
Online motion and path planning of the highly nonlinear Rezero, using RRT and optimal control.<br />
</p>
</div>
</div>
<div id="outline-container-org5ec3d72" class="outline-4">
<h4 id="org5ec3d72"><span class="section-number-4">4.0.7</span> <a href="https://www.slideshare.net/slideshow/embed_code/key/wyRKZKDDHxy1AF">Unsupervised Object Localization</a> [Sep. 2018]</h4>
<div class="outline-text-4" id="text-4-0-7">
<p class="verse">
Extracting the deep-seated spatial information of classification networks by Guided Back-propagating most affecting neurons to the image, enables us to spot image parts corresponding to the object.<br />
</p>

<hr />
</div>
</div>
</div>

<div id="outline-container-orgf749cf0" class="outline-2">
<h2 id="orgf749cf0"><span class="section-number-2">5</span> Experince</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org6ca06d9" class="outline-4">
<h4 id="org6ca06d9"><span class="section-number-4">5.0.1</span> Team Leader at <a href="https://cafebazaar.ir/?l=en">CafeBazaar</a> [Sep. 2019 _Ongoing_]</h4>
<div class="outline-text-4" id="text-5-0-1">
<p class="verse">
I am currently at <a href="https://balad.ir/about">Balad</a> , the biggest domestic map and navigation application of Iran, a product of the Iranian tech giant, CafeBazaar.<br />
<br />
- Technical Leadership and Product Management of Data Infrastructure, a team of 7, responsible for attending to the data science needs of the map tribe (Sep. 2019 - Apr. 2020).<br />
<br />
- Team Leader of Augmented Reality team (Sep. 2019 - Ongoing).<br />
<br />
- Team Leader of ETA&amp;Traffic, a team of Software Engineers and Data Scientists, concerned with ETA and Traffic (-__-) (Apr. 2020 - Ongoing).<br />
<br />
</p>
</div>
</div>
<div id="outline-container-org7c73c57" class="outline-4">
<h4 id="org7c73c57"><span class="section-number-4">5.0.2</span> Senior Data Scientist at CafeBazaar [Oct. 2018 to Sep. 2019]</h4>
<div class="outline-text-4" id="text-5-0-2">
<p class="verse">
I worked at Navigation team at Balad on route planning, traffic prediction, and ETA using data-driven methods. Moreover, as a computer vision scientist I was concerned with information extraction from street and aerial imagery.<br />
</p>
</div>
</div>
<div id="outline-container-org4484fe3" class="outline-4">
<h4 id="org4484fe3"><span class="section-number-4">5.0.3</span> Senior Backend Developer at <a href="https://tapsi.ir/">TAPSI</a> [May. to Oct. 2018]</h4>
<div class="outline-text-4" id="text-5-0-3">
<p class="verse">
I was a member of the Dispatch/Pricing team at TAPSI, which is somehow the heart of any ride-hailing platform. Whenever a ride request is submitted, we are the invisible hands behind, connecting riders and drivers.<br />
</p>
</div>
</div>
<div id="outline-container-orga778d10" class="outline-4">
<h4 id="orga778d10"><span class="section-number-4">5.0.4</span> Data Scientist at TAPSI [Feb. to May. 2018]</h4>
<div class="outline-text-4" id="text-5-0-4">
<p class="verse">
Among the biggest Iranian tech companies, TAPSI is a ride-hailing platform with millions of monthly active users.<br />
</p>

<hr />
</div>
</div>
</div>

<div id="outline-container-org6485b67" class="outline-2">
<h2 id="org6485b67"><span class="section-number-2">6</span> Projects</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org32ad767" class="outline-4">
<h4 id="org32ad767"><span class="section-number-4">6.0.1</span> AR Navigation [Jul. 2019 _Ongoing_]</h4>
<div class="outline-text-4" id="text-6-0-1">
<p class="verse">
Providing users with an Augmented Reality driven experience for navigation.<br />
The team tackled the problem of finding the near-optimal vanishing point for a sequence of input images and depiction of graphical instructions accordingly, from OpenGL scratch. For now, the system is embedded in Balad running on Android phones.<br />
</p>
</div>
</div>
<div id="outline-container-orgcabbe77" class="outline-4">
<h4 id="orgcabbe77"><span class="section-number-4">6.0.2</span> <a href="https://github.com/MahanFathi/OBJET">OBJET: A Computer Vision Graphical Sandbox</a> [Feb. to Mar. 2020]</h4>
<div class="outline-text-4" id="text-6-0-2">
<p class="verse">
OBJET, is a graphical environment, developed in C++/OpenGL and accessible in Python via SWIG, to cater to the data needs of one willing to conduct research on computer vision in such domains. Load your own objects in a room, take a snapshot of the viewport, from the viewpoint of the customizable camera, and load it to python. This gives you the ability to create data on-the-fly, in your python data loader.<br />
</p>
</div>
</div>
<div id="outline-container-orged8ebdf" class="outline-4">
<h4 id="orged8ebdf"><span class="section-number-4">6.0.3</span> Road Extraction from Satellite Imagery [Jan. to Mar. 2020]</h4>
<div class="outline-text-4" id="text-6-0-3">
<p class="verse">
Extraction of the graph of roads from aerial images, via image segmentation and a shitload of post-processing.<br />
</p>
</div>
</div>
<div id="outline-container-orgd45653f" class="outline-4">
<h4 id="orgd45653f"><span class="section-number-4">6.0.4</span> Automated Face, Plate Number, Etc. Censorship of Balad’s Street Imagery via YOLOv3 [Nov. 2019 to Jan. 2020]</h4>
<div class="outline-text-4" id="text-6-0-4">
<p class="verse">
Significantly enhanced the former RCNN driven approach in terms of performance.<br />
</p>
</div>
</div>
<div id="outline-container-org37b2b17" class="outline-4">
<h4 id="org37b2b17"><span class="section-number-4">6.0.5</span> Object Extraction from Satellite Imagery [Dec. 2019 to Jan. 2020]</h4>
<div class="outline-text-4" id="text-6-0-5">
<p>
Extraction of building boundaries, parks, bridges, crosswalks, parking lots, etc. from satellite imagery.
</p>
</div>
</div>
<div id="outline-container-org79635e5" class="outline-4">
<h4 id="org79635e5"><span class="section-number-4">6.0.6</span> Automated Tagging of Crowd-sourced Images [Nov. to Dec. 2019]</h4>
<div class="outline-text-4" id="text-6-0-6">
<p class="verse">
A service responsible for automated tagging of crowd-sourced images with labels such as #indoor/outdoor, #menu, #food, #persons<sub>posing</sub>, etc.<br />
</p>
</div>
</div>
<div id="outline-container-org3321804" class="outline-4">
<h4 id="org3321804"><span class="section-number-4">6.0.7</span> Extraction of Speed Bumps and Traffic Lights from GPS Logs [Dec. 2019]</h4>
</div>
<div id="outline-container-orge1e0765" class="outline-4">
<h4 id="orge1e0765"><span class="section-number-4">6.0.8</span> Live Traffic [Mar. 2019]</h4>
<div class="outline-text-4" id="text-6-0-8">
<p class="verse">
Design, implementation, optimization, deployment, maintenance, and storage of real-time user GPS data, single-handedly. The service assigns a traffic metric to map road segments, which are then used by Navigation and ETA services.<br />
</p>
</div>
</div>
<div id="outline-container-org7e60f13" class="outline-4">
<h4 id="org7e60f13"><span class="section-number-4">6.0.9</span> Street Imagery Sensitive Content Censorship [Feb. 2019]</h4>
<div class="outline-text-4" id="text-6-0-9">
<p class="verse">
YOLOv3 is the core of this fast censor network, responsible for blurring of faces and licence plates in street images.<br />
</p>
</div>
</div>
<div id="outline-container-org98a80ed" class="outline-4">
<h4 id="org98a80ed"><span class="section-number-4">6.0.10</span> RNN ETA [Feb. to Mar. 2019]</h4>
<div class="outline-text-4" id="text-6-0-10">
<p class="verse">
Reducing Balad&rsquo;s ETA MSE by a factor of 2, using a segment-based LSTM, trained on GPS logs.<br />
</p>
</div>
</div>
<div id="outline-container-orgc06bffd" class="outline-4">
<h4 id="orgc06bffd"><span class="section-number-4">6.0.11</span> <a href="https://blog.usejournal.com/collecting-a-nations-points-of-interest-computer-vision-to-the-rescue-41026053bdf6">Detection and Tracking of Points of Interest</a> [Nov. 2018 Jan. 2019]</h4>
<div class="outline-text-4" id="text-6-0-11">
<p class="verse">
Trained and deployed a Mask-RCNN model for detection of the store signs. Also came up with a novel tracking algorithm to bundle up repeating billboards in subsequent images. Read about it at <a href="https://blog.usejournal.com/collecting-a-nations-points-of-interest-computer-vision-to-the-rescue-41026053bdf6">my personal blog</a> and <a href="http://vrgl.ir/jBg3J">CafeBazaar tech blog</a>.<br />
</p>
</div>
</div>
<div id="outline-container-orgffc83ec" class="outline-4">
<h4 id="orgffc83ec"><span class="section-number-4">6.0.12</span> <a href="https://github.com/MahanFathi/end2end-self-driving-car">Learning to Drive in 2 Days</a> [Mar. 2019]</h4>
<div class="outline-text-4" id="text-6-0-12">
<p class="verse">
Inspired by the work of NVIDIA on DAVE-2, in a team of 6, at the 7th Hackathon of CafeBazaar, we collected just enough data, to train an end-to-end deep conv-net to infer steering angle for each captured image. We then came by a pipeline to connect the center camera to this module at the test time. We were able to achieve the MVP of staying in lanes and avoiding doubled-parked cars. <a href="https://vimeo.com/371631581">Here is a video</a>!<br />
</p>
</div>
</div>
<div id="outline-container-orgec8b9ad" class="outline-4">
<h4 id="orgec8b9ad"><span class="section-number-4">6.0.13</span> Location Service Rewrite [Oct. 2018]</h4>
<div class="outline-text-4" id="text-6-0-13">
<p class="verse">
Reducing the response time of TAPSI’s main bottleneck by a crazy factor. We made heavy use of Lua and Redis.<br />
</p>
</div>
</div>
