org/cv/cv.org
*** Semi-concurrent Dispatch Algorithm [May. 2018 Aug. 2018]
#+begin_verse
Implementation of the algorithm as the owner of the project, which resulted in a 3% rise in our finished rides according to RCTs in the first launch. To give you a sense, a percent rise in the ride fulfillment rate in a 6-month long OKR of a team would be an ambitious target.
#+end_verse

-----

* Skills
*** Computer Science
#+begin_verse
- Adept at Deep RL, reviewed many state-of-the-art projects
- Implementation of several projects in computer vision
- Nonlinear optimization, convex optimization and numerical methods
- Mostly experienced at motion generation methods
- Optimal control theory, stochastic control, and robust control
- Direct Policy Search methods and Sequential Quadratic Programming
#+end_verse
*** Programming
#+begin_verse
- Long programming experience in C++, Python, JavaScript, Lua, Java, and Unix Evironment
- TensorFlow, PyTorch/Torch, Caffe, and Keras for Deep Learning Frameworks
- MuJoCo, Unity, and Bullet for Physics + OpenGL and Blender for Graphics
- Experienced in C#, ROS, SQL, OpenGL, Redis and Spark
- Familiarity with a number of nonlinear/convex optimization packages
#+end_verse
*** Other
#+begin_verse
- Linux, Docker, Django, Node.js, LaTeX, C, \\
  Mathematica, Matlab, Simulink, Maple, etc.
- Can’t live w/o Arch, Emacs, and i3
- Expert pencil artist and acoustic guitar fanatic
#+end_verse

-----

* Coursework
*** Machine Learning
#+begin_verse
+ Berkeley's CS294: Deep RL by Sergey Levine
+ David Silver's UCL Course of RL
+ Stanford's CS231n: CNNs for Visual Recognition
#+end_verse
*** Control Theory and Robotics
#+begin_verse
+ Underactuated Robotics by Russ Tedrake
+ Berkeley's CS287: Advanced Robotics by Pieter Abbeel
+ Programming for Robotics - ROS (ETH)
+ Artificial Intelligence for Robotics (Udacity)
#+end_verse
*** Robotics Related Courses from Bachelor
#+begin_verse
+ Mechanism Design (1st in class 19.8/20.0)
+ Engineering Math (1st in class 19.5/20.0)
+ Programming in C (1st in class 20.0/20.0)
+ Dynamics of Machines (3st in class 19.1/20.0)
+ Dynamics and Modeling (3st in class 19.9/20.0)
#+end_verse

-----

* Teaching
*** Mathematica Instructor [Dec. 2016]
#+begin_verse
Two-week long, additional program at Sharif University of Technology.
#+end_verse
*** Physics Olympiad Instructor [Jun. to Nov. 2014]
#+begin_verse
Introduction to Mechanics, Electrodynamics and Differential Equations.
#+end_verse

-----

* Language
*** Persian(native), English(TOEFL iBT: 110 ), and German(basic)

-----

* Interests
|------------------------------------+-------------------------+------------------------------+-------------------|
| *Robotics and Character Animation* | *Machine Learning*      | *Software Engineering*       | *Cool Stuff*      |
|------------------------------------+-------------------------+------------------------------+-------------------|
| Bipedal Locomotion                 | Reinforcement Learning  | Backend Development          | Game Development  |
| Agile Gaits for Quadrupeds         | Optimization Algorithms | Operating Systems <3         | Augmented Reality |
| Hierarchical Planning and Control  | Computer Vision         | Microservices                | Virtual Reality   |
| Kinematic Character Animation      | Computer Graphics       | Machine Learning Engineering | Exotic Editors    |
| Self-driving cars                  | Rethinking Neural Nets  | C/C++!                       | Free Software     |
|------------------------------------+-------------------------+------------------------------+-------------------|
