cv/cv.html
<div id="outline-container-org88bc4ff" class="outline-4">
<h4 id="org88bc4ff"><span class="section-number-4">6.0.14</span> Semi-concurrent Dispatch Algorithm [May. 2018 Aug. 2018]</h4>
<div class="outline-text-4" id="text-6-0-14">
<p class="verse">
Implementation of the algorithm as the owner of the project, which resulted in a 3% rise in our finished rides according to RCTs in the first launch. To give you a sense, a percent rise in the ride fulfillment rate in a 6-month long OKR of a team would be an ambitious target.<br />
</p>

<hr />
</div>
</div>
</div>

<div id="outline-container-org3388b64" class="outline-2">
<h2 id="org3388b64"><span class="section-number-2">7</span> Skills</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orge844c22" class="outline-4">
<h4 id="orge844c22"><span class="section-number-4">7.0.1</span> Computer Science</h4>
<div class="outline-text-4" id="text-7-0-1">
<p class="verse">
- Adept at Deep RL, reviewed many state-of-the-art projects<br />
- Implementation of several projects in computer vision<br />
- Nonlinear optimization, convex optimization and numerical methods<br />
- Mostly experienced at motion generation methods<br />
- Optimal control theory, stochastic control, and robust control<br />
- Direct Policy Search methods and Sequential Quadratic Programming<br />
</p>
</div>
</div>
<div id="outline-container-org3e8e11b" class="outline-4">
<h4 id="org3e8e11b"><span class="section-number-4">7.0.2</span> Programming</h4>
<div class="outline-text-4" id="text-7-0-2">
<p class="verse">
- Long programming experience in C++, Python, JavaScript, Lua, Java, and Unix Evironment<br />
- TensorFlow, PyTorch/Torch, Caffe, and Keras for Deep Learning Frameworks<br />
- MuJoCo, Unity, and Bullet for Physics + OpenGL and Blender for Graphics<br />
- Experienced in C#, ROS, SQL, OpenGL, Redis and Spark<br />
- Familiarity with a number of nonlinear/convex optimization packages<br />
</p>
</div>
</div>
<div id="outline-container-orga29f31d" class="outline-4">
<h4 id="orga29f31d"><span class="section-number-4">7.0.3</span> Other</h4>
<div class="outline-text-4" id="text-7-0-3">
<p class="verse">
- Linux, Docker, Django, Node.js, LaTeX, C, <br />
&#xa0;&#xa0;Mathematica, Matlab, Simulink, Maple, etc.<br />
- Can’t live w/o Arch, Emacs, and i3<br />
- Expert pencil artist and acoustic guitar fanatic<br />
</p>

<hr />
</div>
</div>
</div>

<div id="outline-container-org6506202" class="outline-2">
<h2 id="org6506202"><span class="section-number-2">8</span> Coursework</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org9fabe0f" class="outline-4">
<h4 id="org9fabe0f"><span class="section-number-4">8.0.1</span> Machine Learning</h4>
<div class="outline-text-4" id="text-8-0-1">
<p class="verse">
+ Berkeley&rsquo;s CS294: Deep RL by Sergey Levine<br />
+ David Silver&rsquo;s UCL Course of RL<br />
+ Stanford&rsquo;s CS231n: CNNs for Visual Recognition<br />
</p>
</div>
</div>
<div id="outline-container-org9e53d21" class="outline-4">
<h4 id="org9e53d21"><span class="section-number-4">8.0.2</span> Control Theory and Robotics</h4>
<div class="outline-text-4" id="text-8-0-2">
<p class="verse">
+ Underactuated Robotics by Russ Tedrake<br />
+ Berkeley&rsquo;s CS287: Advanced Robotics by Pieter Abbeel<br />
+ Programming for Robotics - ROS (ETH)<br />
+ Artificial Intelligence for Robotics (Udacity)<br />
</p>
</div>
</div>
<div id="outline-container-org3167da2" class="outline-4">
<h4 id="org3167da2"><span class="section-number-4">8.0.3</span> Robotics Related Courses from Bachelor</h4>
<div class="outline-text-4" id="text-8-0-3">
<p class="verse">
+ Mechanism Design (1st in class 19.8/20.0)<br />
+ Engineering Math (1st in class 19.5/20.0)<br />
+ Programming in C (1st in class 20.0/20.0)<br />
+ Dynamics of Machines (3st in class 19.1/20.0)<br />
+ Dynamics and Modeling (3st in class 19.9/20.0)<br />
</p>

<hr />
</div>
</div>
</div>

<div id="outline-container-org7f8be77" class="outline-2">
<h2 id="org7f8be77"><span class="section-number-2">9</span> Teaching</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-org43a075b" class="outline-4">
<h4 id="org43a075b"><span class="section-number-4">9.0.1</span> Mathematica Instructor [Dec. 2016]</h4>
<div class="outline-text-4" id="text-9-0-1">
<p class="verse">
Two-week long, additional program at Sharif University of Technology.<br />
</p>
</div>
</div>
<div id="outline-container-org2a6002c" class="outline-4">
<h4 id="org2a6002c"><span class="section-number-4">9.0.2</span> Physics Olympiad Instructor [Jun. to Nov. 2014]</h4>
<div class="outline-text-4" id="text-9-0-2">
<p class="verse">
Introduction to Mechanics, Electrodynamics and Differential Equations.<br />
</p>

<hr />
</div>
</div>
</div>

<div id="outline-container-org82c6b84" class="outline-2">
<h2 id="org82c6b84"><span class="section-number-2">10</span> Language</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org44f0924" class="outline-4">
<h4 id="org44f0924"><span class="section-number-4">10.0.1</span> Persian(native), English(TOEFL iBT: 110 ), and German(basic)</h4>
<div class="outline-text-4" id="text-10-0-1">
<hr />
</div>
</div>
</div>

<div id="outline-container-org1387599" class="outline-2">
<h2 id="org1387599"><span class="section-number-2">11</span> Interests</h2>
<div class="outline-text-2" id="text-11">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b>Robotics and Character Animation</b></th>
<th scope="col" class="org-left"><b>Machine Learning</b></th>
<th scope="col" class="org-left"><b>Software Engineering</b></th>
<th scope="col" class="org-left"><b>Cool Stuff</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Bipedal Locomotion</td>
<td class="org-left">Reinforcement Learning</td>
<td class="org-left">Backend Development</td>
<td class="org-left">Game Development</td>
</tr>

<tr>
<td class="org-left">Agile Gaits for Quadrupeds</td>
<td class="org-left">Optimization Algorithms</td>
<td class="org-left">Operating Systems &lt;3</td>
<td class="org-left">Augmented Reality</td>
</tr>

<tr>
<td class="org-left">Hierarchical Planning and Control</td>
<td class="org-left">Computer Vision</td>
<td class="org-left">Microservices</td>
<td class="org-left">Virtual Reality</td>
</tr>

<tr>
<td class="org-left">Kinematic Character Animation</td>
<td class="org-left">Computer Graphics</td>
<td class="org-left">Machine Learning Engineering</td>
<td class="org-left">Exotic Editors</td>
</tr>

<tr>
<td class="org-left">Self-driving cars</td>
<td class="org-left">Rethinking Neural Nets</td>
<td class="org-left">C/C++!</td>
<td class="org-left">Free Software</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Mahan Fathi</p>
<p class="date">Created: 2020-07-03 Fri 13:38</p>
</div>
</body>
</html>
